import React from 'react'
import style from './Policy.module.css'

const Policy = () => {
  return (
    <div className={style.policy}>
      <div className={'customContainer'}>
        <h2 className={style.policy_title}>Політика конфіденційності</h2>
        <div className={style.policy_texts}>
          <p className={style.policy_texts__prgrf}>
            Наша політика конфіденційності описує, як ми збираємо,
            використовуємо та захищаємо інформацію, яку ви надаєте при
            користуванні нашими послугами.
          </p>
          <div>
            <h4 className={style.policy_texts__title}>
              Збір і використання інформації
            </h4>
            <p className={style.policy_texts__prgrf}>
              Ми можемо збирати різноманітну інформацію, включаючи особисті
              дані, такі як ім'я, адреса електронної пошти, номер телефону,
              тощо. Коли ви користуєтеся нашими послугами, ця інформація
              використовується виключно для обробки замовлень, зв'язку з вами та
              надання вам кращого обслуговування.
            </p>
          </div>
          <div>
            <h4 className={style.policy_texts__title}>Захист інформації</h4>
            <p className={style.policy_texts__prgrf}>
              Ми приділяємо велику увагу захисту вашої інформації та вживаємо
              всіх можливих заходів для забезпечення її безпеки. Ми не
              розголошуємо ваші особисті дані третім особам без вашого дозволу,
              крім випадків, передбачених законом.
            </p>
          </div>
          <div>
            <h4 className={style.policy_texts__title}>
              Контроль над вашою інформацією.
            </h4>
            <p className={style.policy_texts__prgrf}>
              Ви маєте право в будь-який час змінювати, видаляти або оновлювати
              інформацію, яку ви надаєте нам. Якщо у вас є будь-які запити щодо
              вашої особистої інформації або політики конфіденційності, будь
              ласка, зв'яжіться з нами.
            </p>
          </div>
          <div>
            <h4 className={style.policy_texts__title}>
              Зміни у політиці конфіденційностіе
            </h4>
            <p className={style.policy_texts__prgrf}>
              Ми можемо періодично оновлювати цю політику конфіденційності, і
              будь-які зміни будуть розміщені на нашому веб-сайті. Продовжуючи
              використовувати наші послуги після внесення змін, ви погоджуєтесь
              з новою версією політики конфіденційності.
            </p>
          </div>
          <div className={style.policy_label}>
            <div className={style.policy_label__wrap}>
              Якщо у вас є будь-які питання або побажання щодо нашої політики
              конфіденційності, будь ласка, зв'яжіться з нами 👋
            </div>
          </div>
        </div>
      </div>
    </div>
  )
}

export { Policy }
